# HasStarted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SubTransaction..::..HasStarted Method
SubTransaction Class See Also
---
Determines whether the sub-transaction has been started yet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasStarted()
```

Visual Basic
---
```text
Public Function HasStarted As Boolean
```

Visual C++
---
```text
public:
bool HasStarted()
```

# ### Return Value
True if the sub-transaction has already started, False otherwise.
# Remarks
A sub-transaction is considered being started after the Start method was called and until the sub-transaction is either committed or rolled back.
# See Also
SubTransaction Class
Autodesk.Revit.DB Namespace